Revit 2026 API

# ElementTypeDuplicatingEventArgs Properties

---

The ElementTypeDuplicatingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPreDocEventArgs) |
|  | ElementTypeId | The id of the ElementType to be duplicated. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

#### Reference

ElementTypeDuplicatingEventArgs Class

Autodesk.Revit.DB.Events Namespace